Revit 2027 API
ForgeTypeId.TypeId Property
 The schema identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string TypeId { get; set; }
Public Property TypeId As String
	Get
	Set
public:
property String^ TypeId {
	String^ get ();
	void set (String^ value);
}
member TypeId : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ForgeTypeId Class
Autodesk.Revit.DB Namespace